app/controllers/movies_controller.rb

  def index
    @movies = Movie.all
---
SELECT `movies`.* FROM `movies`

  def create
    @movie = Movie.new(movie_params)

    respond_to do |format|
      if @movie.save
---
INSERT INTO `movies` (`created_at`, `description`, `name`, `updated_at`) VALUES ('2013-10-06 07:46:56', 'test', 'test', '2013-10-06 07:46:56')

    def set_movie
      @movie = Movie.find(params[:id])
---
SELECT `movies`.* FROM `movies` WHERE `movies`.`id` = 1 LIMIT 1